; domain
(define (domain drone_mission)

  ;; Specify required features
  (:requirements :strips :typing :equality :universal-preconditions)

  ;; Define types
  (:types
    drone support-drone area station sensor - object
  )

  ;; Predicates
  (:predicates
    ;; Drone state and position
    (At ?d - drone ?p - area)
    (LastAt ?d - drone ?p - area)
    (HasSensor ?d - drone ?s - sensor)

    (HasEnergyHigh ?d - drone) ;; Indica se il drone ha energia alta
    (HasEnergyLow ?d - drone) ;; Indica se il drone ha energia bassa

    ;; Area state
    (DataCollected ?a - area ?s - sensor)
    (PriorityHigh ?a - area) ;; Indica se l'area ha priorita' alta
    (PriorityMedium ?a - area) ;; Indica se l'area ha priorita' media
    (PriorityLow ?a - area) ;; Indica se l'area ha priorita' bassa

    (SatelliteDataAvailable ?a - area)
    (RequestedSatelliteData ?a - area)

    ;; Operational constraints
    (Blocked ?from - area ?to - area)
    (DynamicBlocked ?from - area ?to - area)
    (Adj ?from - area ?to - area)
  )

  ;; Action: Move with gradual energy consumption

  (:action MoveHighEnergy
    :parameters (?d - drone ?from - area ?to - area)
    :precondition (and
      (At ?d ?from)
      (Adj ?from ?to)
      (not (Blocked ?from ?to))
      (not (DynamicBlocked ?from ?to))
      (not (LastAt ?d ?to))
      (HasEnergyHigh ?d) ;; Manca questa precondizione
    )
    :effect (and
      (not (At ?d ?from))
      (At ?d ?to)
      (not (HasEnergyHigh ?d))
      (HasEnergyLow ?d) ;; Ora il drone ha energia bassa
    )
  )

  (:action MoveLowEnergy
    :parameters (?d - drone ?from - area ?to - area)
    :precondition (and
      (At ?d ?from)
      (Adj ?from ?to)
      (not (Blocked ?from ?to))
      (not (DynamicBlocked ?from ?to))
      (not (LastAt ?d ?to))
      (HasEnergyLow ?d) ;; Solo se il drone ha energia bassa
    )
    :effect (and
      (not (At ?d ?from))
      (At ?d ?to)
      (not (HasEnergyLow ?d)) ;; Dopo il movimento, il drone è scarico
    )
  )

  ;; Action: Collect data with priority constraints
  (:action CollectData
    :parameters (?d - drone ?a - area ?s - sensor)
    :precondition (and
      (At ?d ?a)
      (HasSensor ?d ?s)
      (not (DataCollected ?a ?s))
      (or (PriorityHigh ?a) (PriorityMedium ?a) (PriorityLow ?a))
    )
    :effect (and
      (DataCollected ?a ?s)
    )
  )

  ;; Action: Swap energy between drones with condition
  (:action RechargeDrone
    :parameters (?support - support-drone ?receiver - drone ?area - area)
    :precondition (and
      (At ?support ?area)
      (At ?receiver ?area)
      (not (HasEnergyHigh ?receiver)) ;; Il drone deve avere energia bassa o scarica
    )
    :effect (and
      (HasEnergyHigh ?receiver) ;; Il drone riceve energia alta
    )
  )

  ;; Action: Request satellite data
  (:action RequestSatelliteData
    :parameters (?d - drone ?a - area)
    :precondition (and
      (At ?d ?a)
      (SatelliteDataAvailable ?a)
      (not (RequestedSatelliteData ?a))
    )
    :effect (RequestedSatelliteData ?a)
  )

  ;; Action: Move support drone directly to the drone in need
  (:action MoveSupportDrone
    :parameters (?support - support-drone ?to - area)
    :precondition (and
      (exists
        (?receiver - drone)
        (and (At ?receiver ?to) (HasEnergyLow ?receiver))) ;; Si muove solo se un drone ha energia bassa
    )
    :effect (and
      (not (At ?support ?from))
      (At ?support ?to)
    )
  )
)

; problem
(define (problem drone_mission_2)
  (:domain drone_mission)

  ;; Objects in the problem
  (:objects
    drone1 drone2 - drone
    drone_support - support-drone
    area1 area2 area3 area4 area5 area6 area7 area8 area9 - area
    temp hum - sensor
  )

  ;; Initial state
  (:init
    ;; Drone initial positions
    (At drone1 area3)
    (At drone2 area9)
    (At drone_support area5)
    (HasEnergyHigh drone1)
    (HasEnergyHigh drone2)
    (HasEnergyHigh drone_support)

    (Adj area1 area2)
    (Adj area2 area3)
    (Adj area4 area5)
    (Adj area5 area6)
    (Adj area7 area8)
    (Adj area8 area9)
    (Adj area1 area4)
    (Adj area2 area5)
    (Adj area3 area6)
    (Adj area4 area7)
    (Adj area5 area8)
    (Adj area6 area9)

    ;; Bidirectional adjacencies
    (Adj area2 area1)
    (Adj area3 area2)
    (Adj area5 area4)
    (Adj area6 area5)
    (Adj area8 area7)
    (Adj area9 area8)
    (Adj area4 area1)
    (Adj area5 area2)
    (Adj area6 area3)
    (Adj area7 area4)
    (Adj area8 area5)
    (Adj area9 area6)

    ;; Sensor capabilities
    (HasSensor drone1 temp)
    (HasSensor drone2 hum)

    ;; Priority levels
    (PriorityHigh area1)
    (PriorityHigh area2)
    (PriorityMedium area3)
  )

  ;; Goals
  (:goal
    (and
      (DataCollected area1 temp)
      (DataCollected area1 hum)
      (DataCollected area2 temp)
      (DataCollected area2 hum)
      (DataCollected area3 temp)
      (DataCollected area3 hum)
    )
  )
)

; plan
1. (collectdata drone1 area3 temp)
   added: (datacollected area3 temp)
   goals met: 1 of 6
2. (movehighenergy drone1 area3 area2)
   deleted: (at drone1 area3) (hasenergyhigh drone1)
   added: (at drone1 area2) (hasenergylow drone1)
   goals met: 1 of 6
3. (collectdata drone1 area2 temp)
   added: (datacollected area2 temp)
   goals met: 2 of 6
4. (movelowenergy drone1 area2 area1)
   deleted: (at drone1 area2) (hasenergylow drone1)
   added: (at drone1 area1)
   goals met: 2 of 6
5. (collectdata drone1 area1 temp)
   added: (datacollected area1 temp)
   goals met: 3 of 6
6. (movehighenergy drone2 area9 area6)
   deleted: (at drone2 area9) (hasenergyhigh drone2)
   added: (at drone2 area6) (hasenergylow drone2)
   goals met: 3 of 6
7. (movesupportdrone drone_support area6)
   added: (at drone_support area6)
   goals met: 3 of 6
8. (rechargedrone drone_support drone2 area6)
   added: (hasenergyhigh drone2)
   goals met: 3 of 6
9. (movelowenergy drone2 area6 area3)
   deleted: (at drone2 area6) (hasenergylow drone2)
   added: (at drone2 area3)
   goals met: 3 of 6
10. (collectdata drone2 area3 hum)
   added: (datacollected area3 hum)
   goals met: 4 of 6
11. (movehighenergy drone2 area3 area2)
   deleted: (at drone2 area3) (hasenergyhigh drone2)
   added: (at drone2 area2) (hasenergylow drone2)
   goals met: 4 of 6
12. (collectdata drone2 area2 hum)
   added: (datacollected area2 hum)
   goals met: 5 of 6
13. (movelowenergy drone2 area2 area1)
   deleted: (at drone2 area2) (hasenergylow drone2)
   added: (at drone2 area1)
   goals met: 5 of 6
14. (collectdata drone2 area1 hum)
   added: (datacollected area1 hum)
   goals met: 6 of 6
